:PROPERTIES:
:ID:       fc3aba86-8ec7-4d31-b54b-acf23f149fd1
:header-args:python: :results output
:END:
#+title: pytorch-数据处理
#+date: [2024-05-12 日]
#+last_modified: [2024-05-13 一 00:03]

#+begin_src python 
  import PIL
  from PIL import Image

  img = Image.open("./data/mona.ico")
  print(img.width)
  print(img.height)

  img = img.resize(size=(64, 64), resample=PIL.Image.NEAREST)
  print(img.width)
  print(img.height)
  
#+end_src

#+RESULTS:
: 128
: 128
: 64
: 64




#+begin_src python
  import numpy as np

  import PIL
  from PIL import Image

  line = np.linspace(0, 255, 256)
  line = np.expand_dims(line, 0)
  img = np.tile(line, (256, 1))
  print(img.shape)

  img = img.astype(np.uint8)
  img = Image.fromarray(img)

  img.save("./data/gradual_light.jpg")
#+end_src

#+RESULTS:
: (256, 256)




#+begin_src python 
  import numpy as np
  import PIL
  from PIL import Image
  import matplotlib.pyplot as plt

  img = Image.open("./data/mona.ico")
  img = np.array(img)

  plt.figure(figsize=(6,5))

  rows = 2
  cols = 2
  for i in range (rows * cols):
    plt.subplot(rows, cols, i + 1)
    plt.title("Figure"+str(i))
    plt.imshow(img)


  plt.savefig("./data/plt_mona.jpg", dpi=500, bbox_inches='tight')
  plt.show()

#+end_src

  #+RESULTS:

